20230902105813-category_computer_vision.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-02 Sat 20:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>category-computer-vision</title>
<meta name="author" content="Keegan Heilman" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">category-computer-vision</h1>


<div id="outline-container-org938886a" class="outline-2">
<h2 id="org938886a">a computer vision topics<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup></h2>
<div class="outline-text-2" id="text-org938886a">
</div>
<div id="outline-container-orgd7296f3" class="outline-3">
<h3 id="orgd7296f3">Image formation / projective geometry /lighting</h3>
</div>
<div id="outline-container-org6bfda65" class="outline-3">
<h3 id="org6bfda65">Practical linear algebra</h3>
</div>
<div id="outline-container-org81740e3" class="outline-3">
<h3 id="org81740e3">Image processing / descriptors</h3>
</div>
<div id="outline-container-orgaa14b44" class="outline-3">
<h3 id="orgaa14b44">Image warping</h3>
</div>
<div id="outline-container-orgcff8088" class="outline-3">
<h3 id="orgcff8088">Linear models + optimization</h3>
</div>
<div id="outline-container-org54ecfd0" class="outline-3">
<h3 id="org54ecfd0">Applications of neural networks</h3>
</div>
<div id="outline-container-org9bba2c9" class="outline-3">
<h3 id="org9bba2c9">motion and flow</h3>
</div>
<div id="outline-container-org1267a16" class="outline-3">
<h3 id="org1267a16">single-view geometry</h3>
</div>
<div id="outline-container-org1febe3b" class="outline-3">
<h3 id="org1febe3b">multi-view geometry</h3>
</div>
</div>

<div id="outline-container-org6d8ca36" class="outline-2">
<h2 id="org6d8ca36">suggested prerequisites</h2>
<div class="outline-text-2" id="text-org6d8ca36">
<ul class="org-ul">
<li>Data structures <br /></li>
<li>programming language(s) (suggested: python/C++) <br /></li>
<li>statistics &amp; probability <br /></li>
<li>git and GitHub <br /></li>
<li>Linear algebra <br /></li>
<li>vector calculus <br /></li>
</ul>
</div>
</div>

<div id="outline-container-org2b9864e" class="outline-2">
<h2 id="org2b9864e">additional resources</h2>
<div class="outline-text-2" id="text-org2b9864e">
</div>
<div id="outline-container-org5d011ac" class="outline-3">
<h3 id="org5d011ac">courses</h3>
<div class="outline-text-3" id="text-org5d011ac">
<ul class="org-ul">
<li>CSE 576: Introduction to Computer Vision. Steve Seitz, Rick Szeliski, Harpreet Sawhney. UWASH S20. <br />
<a target='_blank' rel='noopener noreferrer' class='external' href="https://courses.cs.washington.edu/courses/cse576/20sp/">link</a> <br /></li>
<li>CS 5670: Introduction to Computer Vision. Noah Snavely. Cornell Tech S23. <br />
<a target='_blank' rel='noopener noreferrer' class='external' href="http://www.cs.cornell.edu/courses/cs5670/2023sp/">link</a> <br /></li>
<li>EECS 504: Foundations of Computer Vision. Andrew Owens. UMICH W20.  <br />
<a target='_blank' rel='noopener noreferrer' class='external' href="https://web.eecs.umich.edu/~ahowens/eecs504/w20/">link</a> <br /></li>
<li>CSAIL 6.8300/6.8301: Advances in Computer Vision. Bill Freeman, Antonio Torralba, &amp; Phillip Isola. MIT S23. <br />
<a target='_blank' rel='noopener noreferrer' class='external' href="http://6.8300.csail.mit.edu/sp23/materials.html">link</a> <br /></li>
<li>EECS 498.008/598.008: Deep Learning for Computer Vision. Justin Johnson. UMICH W22. <br />
<a target='_blank' rel='noopener noreferrer' class='external' href="https://web.eecs.umich.edu/~justincj/teaching/eecs498/WI2022/syllabus.html">link</a> <br /></li>
<li>CS231n: Deep Learning for Computer Vision. Fei Fei Li, Yunzhu Li, &amp; Ruohan Gao. Standord S23. <br />
<a target='_blank' rel='noopener noreferrer' class='external' href="http://cs231n.stanford.edu/">link</a> <br /></li>
</ul>
</div>
</div>

<div id="outline-container-org4c18b5d" class="outline-3">
<h3 id="org4c18b5d">books</h3>
<div class="outline-text-3" id="text-org4c18b5d">
<ul class="org-ul">
<li>Szeliski, Richard.<a href="20230902111854-szeliski_computer_vision_algorithms_and_applications_2ed.html#ID-86407e24-a970-45ae-af02-423794329cbc">Computer Vision: Algorithms and Applications, 2nd ed.</a> <br /></li>
<li>Forsyth &amp; Ponce. <a href="20230902112753-forsyth_ponce_computer_vision_a_modern_approach_2ed.html#ID-c0c2d9bb-8298-4406-bd7a-3415e2fa14c1">Computer Vision: A Modern Approach 2nd ed.</a> <br /></li>
<li>Hastie, Tibshirani, &amp; Friedman. <a href="20230902113224-the_elements_of_statistical_learning.html#ID-f2173c7c-5658-46f3-b55e-a29d757e988a">The Elements of Statistical Learning</a> <br /></li>
</ul>
</div>
</div>

<div id="outline-container-org0d04750" class="outline-3">
<h3 id="org0d04750">additional recommended reading</h3>
<div class="outline-text-3" id="text-org0d04750">
<ul class="org-ul">
<li>Palmer, S. E. (1999). Vision Science: Photons to Phenomenology. The MIT Press, Cambridge, Massachusetts. <br />
<a target='_blank' rel='noopener noreferrer' class='external' href="https://mitpress.mit.edu/9780262161831/vision-science/">link</a> <br /></li>
<li></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org74751f3" class="outline-2">
<h2 id="org74751f3">Links to this note</h2>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
originally derived from <a target='_blank' rel='noopener noreferrer' class='external' href="https://web.eecs.umich.edu/~justincj/teaching/eecs442//WI2020/syllabus.html">syllabus link</a> <br />
</p></div></div>


</div>
</div></div>
</body>
</html>